In [3]:
import pandas as pd

### Pandas Replace

Pandas Replace will replace values in your DataFrame with another value. This function starts simple, but gets flexible & fun later on.

We will run through 7 examples:
1. Single 1<>1 replace across your whole DataFrame
2. Single Many<>1 replace across your whole DataFrame
3. Many 1<>1 replaces across your whole DataFrame
4. Many 1<>1 replaces across your whole DataFrame via a dictionary
5. 1<>1 column specific replaces across multiple columns via a dictionary
6. Many 1<>1 replaces with a single column via a dictionary
7. Backfill a value with another value in the row below.


Let's create our DataFrame

In [4]:
df = pd.DataFrame({'X': [1, 2, 3, 4, 5],
                   'Y': [5, 6, 7, 8, 9],
                   'Z': ['z', 'y', 'x', 'w', 'v']})
df

   X  Y  Z
0  1  5  z
1  2  6  y
2  3  7  x
3  4  8  w
4  5  9  v

### 1. Single 1<>1 replace across your whole DataFrame
Here we will find a all instances of a single value in our DataFrame, and replace it with something else.

Here all of the 2s are being replaced with 20s

In [27]:
df.replace(to_replace=2, value=20)

    X  Y  Z
0   1  5  z
1  20  6  y
2   3  7  x
3   4  8  w
4   5  9  v

### 2. Single Many<>1 replace across your whole DataFrame
Here we will pass a list of values in our DataFrame that we want to replace with something else

We will replace all 1s, 3s, and 5s with 20

In [28]:
df.replace(to_replace=[1,3,5], value=20)

    X   Y  Z
0  20  20  z
1   2   6  y
2  20   7  x
3   4   8  w
4  20   9  v

### 3. Many 1<>1 replaces across your whole DataFrame
Here we will pass two lists, one of values that *need replacing*, and one with the valuing that will *do replacing*

Notice that the 1s get replaced with 10s, the 3s with 30s and the 5s with 50s

In [29]:
df.replace(to_replace=[1,3,5], value=[10,30,50])

    X   Y  Z
0  10  50  z
1   2   6  y
2  30   7  x
3   4   8  w
4  50   9  v

### 4. Many 1<>1 replaces across your whole DataFrame via a dictionary
Here we will pass a dictionary. The dictionary keys are the values we want to replace and the dictionary values are the values doing the replacing.

We are replacing 1s with 10s, 'z's with 'zz's, and 'v's with 'vvv's

In [30]:
df.replace(to_replace={1: 10, 'z':'zz', 'v':'vvv'}, value=None)

    X  Y    Z
0  10  5   zz
1   2  6    y
2   3  7    x
3   4  8    w
4   5  9  vvv

### 5. 1<>1 column-specific replaces across multiple columns via a dictionary
One interesting feature of pandas.replace is that you can specify values to replace *per column.* **Example**: you may want to only replace the 1s in your first column, but not in your second column.

To do this, you need to have a nested dict. The parent dict will have the column you want to specify, the child dict will have the values to replace.

Here we are replacing the 5s in column X (only) with 50s

In [16]:
df.replace(to_replace={'X': {5: 50}}, value=None)

    X  Y  Z
0   1  5  z
1   2  6  y
2   3  7  x
3   4  8  w
4  50  9  v

### 6. Many 1<>1 column-specific replaces via a dictionary
We'll do the same thing here, but multiple values within multiple columns

Here we are doing a few replaces:
* In column "X": Replace 1s with 10s and 4s with 40s
* In column "Y": Replace 8s with 80s and 9s with 99s
* In column "Z": Replace 'z's with 'zzz's, 'y's with 'yyy's and 'x's with 'xx's

In [31]:
df.replace(to_replace={'X': {1: 10, 4: 40},\
                       'Y': {8: 80, 9: 99},
                       'Z': {'z': 'zzz', 'y': 'yyy', 'x': 'xx'},}, value=None)

    X   Y    Z
0  10   5  zzz
1   2   6  yyy
2   3   7   xx
3  40  80    w
4   5  99    v

### 7. Backfill a value with another value in the row below.
For this example, we will specify *to_replace* with value=None. However this time, we will also set method='bfill' which will fill a value with the row below it.

Here we are replacing 1, 2, 'w', and 4 with the values in the next row below them. This is most helpful when you have NAs (look into using .fillna()) or when you want to overwrite.

Notice how both 1 and 2 were getting replaced in column X, with method='bfill', the 3 filled both 1 and 2

In [33]:
df.replace([1, 2, 'w', 4], value=None, method='bfill')

   X  Y  Z
0  3  5  z
1  3  6  y
2  3  7  x
3  5  8  v
4  5  9  v